#!/bin/bash
# А че делаем?
# 1 - вносим изменения в сорц.лист, поскольку авторы дебиана за каким-то решили, что делать этот файл пустым - идея хорошая. Желаем им добра и меняем на нормальные
# 2 - обновляемся
# 3 - ставим аппсы: apt-transport-https, ca-certificates, fail2ban, mcedit, curl
# 4 - вносим очень важный твик ядра, который --ЗНАЧИТЕЛЬНО-- увеличит производительность сетевой составляющей сервера, это особенно заметно,если подключений будет много
# 5 - чистим старые пакеты
# 6 - ставим 3x-ui и отдаем управление этому скрипту
# 7 - ребутаемся и все
#============================================================================================================================
srcl="/etc/apt/sources.list" #--переменная сорц листа
sysctlc="/etc/sysctl.conf" #-- переменная сисцтл, куда внесем изменения для твика ядра
applications=(apt-transport-https ca-certificates fail2ban mcedit curl) #-- переменная цикла -- Тут пишем аппсы, БЕЗ запятых, ТОЛЬКО с пробелами
#============================================================================================================================
printf "\033[93m Изменение репозиториев... \033[0m"
#- чистим файл
echo -e "" > $srcl
# Добавляем новые строки в файл
echo -e "deb http://deb.debian.org/debian bookworm main non-free-firmware" >> $srcl
echo -e "deb-src http://deb.debian.org/debian bookworm main non-free-firmware" >> $srcl
#
echo -e "deb http://security.debian.org/debian-security bookworm-security main non-free-firmware" >> $srcl
echo -e "deb-src http://security.debian.org/debian-security bookworm-security main non-free-firmware" >> $srcl

echo -e "deb http://deb.debian.org/debian bookworm-updates main non-free-firmware" >> $srcl
echo -e "deb-src http://deb.debian.org/debian bookworm-updates main non-free-firmware" >> $srcl
#
#============================================================================================================================
printf "\033[93m Запускается обновление системы... \033[0m"
apt update && apt upgrade -y # - индексирует содержимое репозиториев > обновляет систему > скипает вопросы установщика
printf "\033[93m Система обновлена \033[0m"
#
printf "\033[93m Выполняется установка приложений.. \033[0m"
for app in "${applications[@]}"
do
    sudo apt install -y "$app"
done
printf "\033[93m Приложения установлены \033[0m"
#============================================================================================================================
#-- чрезвычайно важный твик ядра для сервера, НА ПОРЯДКИ! Увеличивает пропускную способность. src: https://joyreactor.cc/post/5761728
echo "net.core.default_qdisc=fq" >> $sysctlc 
echo "net.ipv4.tcp_congestion_control=bbr" >> $sysctlc
sysctl -p
#SYSRESULT="$(/usr/sbin/sysctl -a | grep congestion)"
#/usr/sbin/sysctl -p - для дебиан 12 в варианте десктопа
#printf "\033[93m Изменения в ядро $SYSRESULT внесены  \033[0m"
#============================================================================================================================
printf "\033[93m Запуск очистки системы от старых пакетов... \033[0m"
apt autoremove -y #--- чистим старые пакеты автоудалятором
#============================================================================================================================
printf "\033[93m А теперь внимательно - сейчас управление будет передано 3x-ui. \033[0m"
printf "\033[93m ОЧЕНЬ внимательно читаем, че там будет написано. \033[0m"
printf "\033[93m Он спросит - настроить-ли панель управления? НЕТ - идеально, т.к. нам нужно скрыть факт нахождения впн на своем сервере \033[0m"
printf "\033[93m Прочитал? \033[0m"
read -p "Жмем Энтер, начнется установка и ждем, пока он задаст вопрос."
#============================================================================================================================
#--- 3x UI
bash <(curl -Ls https://raw.githubusercontent.com/mhsanaei/3x-ui/master/install.sh)
#============================================================================================================================
#
printf "\033[93m Готово. \033[0m"
read -p "Задачи завершены. ОБЯЗАТЕЛЬНО сделай перезагрузку после того, как сохранишь данные для подключения"
